artillery/artillery.yml
config:
  target: "http://localhost:3003"
  phases:
    - duration: 60
      arrivalRate: 20
  processor: "./artillery-data.js"

scenarios:
  - name: "Load products"
    flow:
      - function: "generateRandomId"
      - get:
          url: "/product/{{ id }}/related"
      - log: "send GET /product/{{ id }}/related"